## Plan Result (ptlsbox-logicapp)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_logic_app_workflow.logic_app_workflow




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_logic_app_workflow.logic_app_workflow will be created
  + resource "azurerm_logic_app_workflow" "logic_app_workflow" {
      + access_endpoint                 = (known after apply)
      + connector_endpoint_ip_addresses = (known after apply)
      + connector_outbound_ip_addresses = (known after apply)
      + enabled                         = true
      + id                              = (known after apply)
      + location                        = "uksouth"
      + name                            = "github-jenkins-ptlsbox"
      + resource_group_name             = "github-jenkins-cft-ptlsbox-rg"
      + tags                            = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/github-jenkins-integration"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + workflow_endpoint_ip_addresses  = (known after apply)
      + workflow_outbound_ip_addresses  = (known after apply)
      + workflow_schema                 = "https://schema.management.azure.com/providers/Microsoft.Logic/schemas/2016-06-01/workflowdefinition.json#"
      + workflow_version                = "1.0.0.0"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":7,"Program":"tfcmt","SHA1":"","Target":"ptlsbox-logicapp","Vars":{}} -->